ukhan717/VncWsFtp/FS/Setup/STM32F746_ST_STM32F746G_Discovery/FS_MMC_CM_HW_STM32F746_ST_STM32F746G-DISCO.c
/*********************************************************************
*                     SEGGER Microcontroller GmbH                    *
*                        The Embedded Experts                        *
**********************************************************************
*                                                                    *
*       (c) 2003 - 2019  SEGGER Microcontroller GmbH                 *
*                                                                    *
*       www.segger.com     Support: support@segger.com               *
*                                                                    *
**********************************************************************
----------------------------------------------------------------------
File       : FS_MMC_CM_HW_STM32F746_ST_STM32F746G-DISCO.c
Purpose    : Hardware layer for MMC/SD driver in card mode ST STM32F746G-DISCO eval board.
Literature :
  [1] RM0385 Reference manual STM32F75xxx and STM32F74xxx advanced ARM-based 32-bit MCUs
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32F7\RM0385_STM32F74xxx_STM32F75xxx_Rev5_DM00124865.pdf)
  [2] STM32F74xxx STM32F75xxx Errata sheet
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32F7\STM32F74xxx_STM32F75xxx_Errata_Rev3.pdf)
  [3] UM1907 User manual Discovery kit for STM32F7 Series with STM32F746NG MCU
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32F7\EvalBoard\STM32F746_Discovery\DM00190424.pdf)
---------------------------END-OF-HEADER------------------------------
*/

/*********************************************************************
*
*       #include section
*
**********************************************************************
*/
#include <stddef.h>
#include "FS.h"
#include "MMC_SD_CardMode_X_HW.h"
#include "stm32f7xx.h"

/*********************************************************************
*
*       Defines, configurable
*
**********************************************************************
*/
#define SDMMC_CLK_KHZ       48000       // Clock of SDMMC unit
#define MAX_SD_CLK_KHZ      48000       // Maximum transfer speed
#define USE_OS              0           // Selects the operating mode: 1 - event-driven, 0 - polling
#define POWER_GOOD_DELAY    50          // Number of  milliseconds to wait for the power supply of SD card to become ready
#define ALIGNED_DMA_BURSTS  0           // When set to 1 the DMA burst is aligned to the address and the number of bytes to be transferred.
#define HCLK                216000000
#define PCLK2               (HCLK / 2)

/*********************************************************************
*
*       #include section, conditional
*
**********************************************************************
*/
#if USE_OS
  #include "RTOS.h"
#endif

/*********************************************************************
*
*       Defines, non-configurable
*
**********************************************************************
*/

/*********************************************************************
*
*       SDMMC interface registers
*/
#define SDMMC_BASE_ADDR         0x40012C00uL
#define SDMMC_POWER             (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x00))
#define SDMMC_CLKCR             (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x04))
#define SDMMC_ARG               (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x08))
#define SDMMC_CMD               (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x0C))
#define SDMMC_RESPCMD           (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x10))
#define SDMMC_RESP1             (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x14))
#define SDMMC_RESP2             (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x18))
#define SDMMC_RESP3             (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x1C))
#define SDMMC_RESP4             (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x20))
#define SDMMC_DTIMER            (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x24))
#define SDMMC_DLEN              (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x28))
#define SDMMC_DCTRL             (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x2C))
#define SDMMC_DCOUNT            (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x30))
#define SDMMC_STA               (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x34))
#define SDMMC_ICR               (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x38))
#define SDMMC_MASK              (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x3C))
#define SDMMC_FIFOCNT           (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x48))
#define SDMMC_FIFO              (*(volatile U32 *)(SDMMC_BASE_ADDR + 0x80))

/*********************************************************************
*
*       Reset and clock control registers
*/
#define RCC_BASE_ADDR           0x40023800uL
#define RCC_AHB1RSTR            (*(volatile U32 *)(RCC_BASE_ADDR + 0x10))
#define RCC_APB2RSTR            (*(volatile U32 *)(RCC_BASE_ADDR + 0x24))
#define RCC_AHB1ENR             (*(volatile U32 *)(RCC_BASE_ADDR + 0x30))
#define RCC_APB2ENR             (*(volatile U32 *)(RCC_BASE_ADDR + 0x44))

/*********************************************************************
*
*       Port C registers
*/
#define GPIOC_BASE_ADDR         0x40020800uL
#define GPIOC_MODER             (*(volatile U32 *)(GPIOC_BASE_ADDR + 0x00))
#define GPIOC_OSPEEDR           (*(volatile U32 *)(GPIOC_BASE_ADDR + 0x08))
#define GPIOC_PUPDR             (*(volatile U32 *)(GPIOC_BASE_ADDR + 0x0C))
#define GPIOC_IDR               (*(volatile U32 *)(GPIOC_BASE_ADDR + 0x10))
#define GPIOC_AFRL              (*(volatile U32 *)(GPIOC_BASE_ADDR + 0x20))
#define GPIOC_AFRH              (*(volatile U32 *)(GPIOC_BASE_ADDR + 0x24))

/*********************************************************************
*
*       Port D registers
*/
#define GPIOD_BASE_ADDR         0x40020C00uL
#define GPIOD_MODER             (*(volatile U32 *)(GPIOD_BASE_ADDR + 0x00))
#define GPIOD_OSPEEDR           (*(volatile U32 *)(GPIOD_BASE_ADDR + 0x08))
#define GPIOD_PUPDR             (*(volatile U32 *)(GPIOD_BASE_ADDR + 0x0C))
#define GPIOD_AFRL              (*(volatile U32 *)(GPIOD_BASE_ADDR + 0x20))

/*********************************************************************
*
*       DMA 2 registers
*/
#define DMA2_BASE_ADDR          0x40026400uL
#define DMA2_LISR               (*(volatile U32 *)(DMA2_BASE_ADDR + 0))
#define DMA2_HISR               (*(volatile U32 *)(DMA2_BASE_ADDR + 4))
#define DMA2_LIFCR              (*(volatile U32 *)(DMA2_BASE_ADDR + 8))
#define DMA2_HIFCR              (*(volatile U32 *)(DMA2_BASE_ADDR + 12))
#define DMA2_S3CR               (*(volatile U32 *)(DMA2_BASE_ADDR + 24 * 3 + 16))
#define DMA2_S3NDTR             (*(volatile U32 *)(DMA2_BASE_ADDR + 24 * 3 + 20))
#define DMA2_S3PAR              (*(volatile U32 *)(DMA2_BASE_ADDR + 24 * 3 + 24))
#define DMA2_S3M0AR             (*(volatile U32 *)(DMA2_BASE_ADDR + 24 * 3 + 28))
#define DMA2_S3FCR              (*(volatile U32 *)(DMA2_BASE_ADDR + 24 * 3 + 36))

/*********************************************************************
*
*       System Control Block
*/
#define SCB_BASE_ADDR           0xE000E000uL
#define SCB_CCR                 (*(volatile U32 *)(SCB_BASE_ADDR + 0x014))    // Configuration Control Register

/*********************************************************************
*
*       Reset and clock bits for the peripherals used by the driver
*/
#define AHB1ENR_DMA2EN          (1uL << 22)
#define AHB1ENR_PORTCEN         (1uL << 2)
#define AHB1ENR_PORTDEN         (1uL << 3)
#define APB2ENR_SDMMCEN         (1uL << 11)
#define APB2RSTR_SDMMCRST       (1uL << 11)

/*********************************************************************
*
*       SDMMC status register
*/
#define STA_CCRCFAIL            (1uL << 0)
#define STA_DCRCFAIL            (1uL << 1)
#define STA_CTIMEOUT            (1uL << 2)
#define STA_DTIMEOUT            (1uL << 3)
#define STA_TXUNDERR            (1uL << 4)
#define STA_RXOVERR             (1uL << 5)
#define STA_CMDREND             (1uL << 6)
#define STA_CMDSENT             (1uL << 7)
#define STA_DATAEND             (1uL << 8)
#define STA_STBITERR            (1uL << 9)
#define STA_DBCKEND             (1uL << 10)
#define STA_CMDACT              (1uL << 11)
#define STA_TXACT               (1uL << 12)
#define STA_RXACT               (1uL << 13)

/*********************************************************************
*
*       SDMMC data control register
*/
#define DCTRL_DTEN              (1uL << 0)
#define DCTRL_DTDIR             (1uL << 1)
#define DCTRL_DTMODE            (1uL << 2)
#define DCTRL_DMAEN             (1uL << 3)
#define DCTRL_DBLOCKSIZE_SHIFT  4uL

/*********************************************************************
*
*       SDMMC clock control register
*/
#define CLKCR_CLKEN             (1uL   << 8)
#define CLKCR_CLK_PWRSAV        (0x1uL << 9)
#define CLKCR_CLK_BYPASS        (0x1uL << 10)
#define CLKCR_WIDBUS_MASK       (0x3uL << 11)
#define CLKCR_WIDBUS_4BIT       (0x1uL << 11)
#define CLKCR_WIDBUS_8BIT       (0x2uL << 11)
#define CLKCR_HWFC_EN           (1uL   << 14)

/*********************************************************************
*
*       SDMMC command register
*/
#define CMD_CMD_MASK            (0x3FuL)
#define CMD_WAITRESP_SHORT      (1uL << 6)
#define CMD_WAITRESP_LONG       (3uL << 6)
#define CMD_WAITPEND            (1uL << 9)
#define CMD_CPSMEN              (1uL << 10)

/*********************************************************************
*
*       SDMMC interrupt control register
*/
#define ICR_CCRCFAIL            (1uL << 0)
#define ICR_DCRCFAIL            (1uL << 1)
#define ICR_CTIMEOUT            (1uL << 2)
#define ICR_DTIMEOUT            (1uL << 3)
#define ICR_TXUNDERR            (1uL << 4)
#define ICR_RXOVERR             (1uL << 5)
#define ICR_CMDREND             (1uL << 6)
#define ICR_CMDSENT             (1uL << 7)
#define ICR_DATAEND             (1uL << 8)
#define ICR_STBITERR            (1uL << 9)
#define ICR_DBCKEND             (1uL << 10)
#define ICR_SDIOIT              (1uL << 22)
#define ICR_CEATAEND            (1uL << 23)
#define ICR_MASK_STATIC         (ICR_CCRCFAIL | \
                                 ICR_DCRCFAIL | \
                                 ICR_CTIMEOUT | \
                                 ICR_DTIMEOUT | \
                                 ICR_TXUNDERR | \
                                 ICR_RXOVERR  | \
                                 ICR_CMDREND  | \
                                 ICR_CMDSENT  | \
                                 ICR_DATAEND  | \
                                 ICR_STBITERR | \
                                 ICR_DBCKEND  | \
                                 ICR_SDIOIT   | \
                                 ICR_CEATAEND)

/*********************************************************************
*
*       SDMMC interrupt mask register
*/
#define MASK_CCRCFAILIE         (1uL << 0)
#define MASK_DCRCFAILIE         (1uL << 1)
#define MASK_CTIMEOUTIE         (1uL << 2)
#define MASK_DTIMEOUTIE         (1uL << 3)
#define MASK_TXUNDERRIE         (1uL << 4)
#define MASK_RXOVERRIE          (1uL << 5)
#define MASK_CMDRENDIE          (1uL << 6)
#define MASK_CMDSENTIE          (1uL << 7)
#define MASK_DATAENDIE          (1uL << 8)
#define MASK_STBITERRIE         (1uL << 9)
#define MASK_DBCKENDIE          (1uL <<10)
#define MASK_ALL                (MASK_CCRCFAILIE | \
                                 MASK_DCRCFAILIE | \
                                 MASK_CTIMEOUTIE | \
                                 MASK_DTIMEOUTIE | \
                                 MASK_TXUNDERRIE | \
                                 MASK_RXOVERRIE  | \
                                 MASK_CMDRENDIE  | \
                                 MASK_CMDSENTIE  | \
                                 MASK_DATAENDIE  | \
                                 MASK_STBITERRIE | \
                                 MASK_DBCKENDIE)

/*********************************************************************
*
*       SDMMC data length register
*/
#define DLEN_DATALENGTH_MASK    (0x03FFFFFFuL)

/*********************************************************************
*
*       GPIO bit positions of SD card lines
*
*/
#define SD_D0_BIT               8     // Port C
#define SD_D1_BIT               9     // Port C
#define SD_D2_BIT               10    // Port C
#define SD_D3_BIT               11    // Port C
#define SD_CLK_BIT              12    // Port C
#define SD_CD_BIT               13    // Port C
#define SD_CMD_BIT              2     // Port D

/*********************************************************************
*
*       DMA2 related defines
*/
#define LIFCR_CFEIF3            (1uL << 22)
#define LIFCR_CDMEIF3           (1uL << 24)
#define LIFCR_CTCIF3            (1uL << 25)
#define LIFCR_CHTIF3            (1uL << 26)
#define LIFCR_CTEIF3            (1uL << 27)
#define LISR_FEIF3              (1uL << 22)
#define LISR_TEIF3              (1uL << 25)
#define LISR_TCIF3              (1uL << 27)
#define S3CR_EN                 (1uL << 0)
#define S3CR_TEIE               (1uL << 2)
#define S3CR_TCIE               (1uL << 4)
#define S3CR_DIR_MASK           (3uL << 6)
#define S3CR_DIR_M2P            (1uL << 6)
#define S3CR_DIR_M2M            (2uL << 6)
#define S3CR_PINC               (1uL << 9)
#define S3CR_MINC               (1uL << 10)
#define S3CR_PSIZE_32BIT        (2uL << 11)
#define S3CR_MSIZE_32BIT        (2uL << 13)
#define S3CR_PRIO_HIGH          (3uL << 16)
#define S3CR_CHSEL_CH4          (4uL << 25)
#define S3CR_PFCTRL             (1uL << 5)
#define S3CR_PBURST_INCR4       (1uL << 21)
#define S3CR_MBURST_INCR4       (1uL << 23)
#define S3CR_MBURST_NONE        (0uL << 23)
#define S3CR_MBURST_MASK        (3uL << 23)
#define S3FCR_DMDIS             (1uL << 2)
#define S3FCR_FTH_FULL          (3uL << 0)

/*********************************************************************
*
*       Misc. defines
*/
#define PERIPHERAL_TO_MEMORY    0
#define MEMORY_TO_PERIPHERAL    1
#define DMA_MAX_NUM_TRANSFERS   65535
#define MAX_BLOCK_SIZE          512     // Maximum number of bytes in a transferred data block
#define BLOCK_ALIGNMENT         64
#define MAX_NUM_BLOCKS          (((DMA_MAX_NUM_TRANSFERS * 4) / MAX_BLOCK_SIZE) & ~(BLOCK_ALIGNMENT - 1))   // * 4 since the DMA is configured to transfer 4 bytes at once
#define WAIT_TIMEOUT_MAX        1000
#define SDMMC_PRIO              15
#define DMA_PRIO                15
#define CCR_DC_BIT              16
#define CACHE_LINE_SIZE         32     // Number of bytes in a cache line.

/*********************************************************************
*
*       Static data
*
**********************************************************************
*/
static U8               _IgnoreCRC;
static U16              _BlockSize;
static U16              _NumBlocks;
static U32              _DataBlockSize;
static void           * _pBuffer;
static U32              _NumLoopsWriteRegDelay;
static U32              _aCacheBuffer[((CACHE_LINE_SIZE * 2) + CACHE_LINE_SIZE) / 4];
static U32            * _pCacheBuffer;
static U8               _IsR1Busy;
#if USE_OS
  static volatile U32   _StatusSDIO;
  static volatile U32   _StatusDMA;
#endif
#if (FS_VERSION > 40405)
  static U8             _RepeatSame;
#endif

/*********************************************************************
*
*       Static code
*
**********************************************************************
*/

/*********************************************************************
*
*       _ld
*/
static U16 _ld(U32 Value) {
  U16 i;

  for (i = 0; i < 16; i++) {
    if ((1uL << i) == Value) {
      break;
    }
  }
  return i;
}

/*********************************************************************
*
*       _RoundUpToCacheLine
*/
static U32 _RoundUpToCacheLine(U32 v) {
  if (v & (CACHE_LINE_SIZE - 1)) {
    v &= ~(CACHE_LINE_SIZE - 1);
    v += CACHE_LINE_SIZE;
  }
  return v;
}

/*********************************************************************
*
*       _RoundDownToCacheLine
*/
static U32 _RoundDownToCacheLine(U32 v) {
  if (v & (CACHE_LINE_SIZE - 1)) {
    v &= ~(CACHE_LINE_SIZE - 1);
  }
  return v;
}

/*********************************************************************
*
*       _Delay1ms
*
*  Function description
*    Blocks the program execution for about 1ms.
*    The number of loops must be adjusted according to the CPU speed.
*/
static void _Delay1ms(void) {
#if USE_OS
  OS_Delay(1);
#else
  volatile unsigned NumLoops;

  NumLoops = 18000;
  do {
    ;
  } while(--NumLoops);
#endif
}

/*********************************************************************
*
*       _StartDMATransfer
*/
static void _StartDMATransfer(U32 * pMemory, U32 * pPripheral, U8 Direction) {
  DMA2_S3CR   &= ~S3CR_EN;          // Stop the data transfer
  while (DMA2_S3CR & S3CR_EN) {     // Wait for the stream to switch off
    ;
  }
  DMA2_S3PAR  = (U32)pPripheral;    // Periphery data register address
  DMA2_S3M0AR = (U32)pMemory;       // Memory buffer address
  DMA2_S3NDTR = 0;
  DMA2_LIFCR  = 0                   // Clear any pending interrupts.
              | LIFCR_CDMEIF3
              | LIFCR_CTEIF3
              | LIFCR_CHTIF3
              | LIFCR_CTCIF3
              | LIFCR_CFEIF3
              ;
  DMA2_S3CR   = 0
              | S3CR_PSIZE_32BIT    // Peripheral bus width
              | S3CR_MSIZE_32BIT    // Memory bus width
              | S3CR_MINC           // Memory increment enable
              | S3CR_PRIO_HIGH      // Set priority to high
              | S3CR_CHSEL_CH4      // Channel connected to SDMMC
              | S3CR_PFCTRL         // Peripheral controls the data transfer
              | S3CR_PBURST_INCR4   // Burst transfer on peripheral side
              | S3CR_MBURST_INCR4   // Burst transfer on memory side
              ;
  if (Direction == MEMORY_TO_PERIPHERAL) {
    DMA2_S3CR |= S3CR_DIR_M2P;
  }
  DMA2_S3FCR  = 0
              | S3FCR_FTH_FULL      // Full FIFO
              | S3FCR_DMDIS         // Disable direct mode (the only way the DMA transfer works together with SDMMC)
              ;
#if USE_OS
  DMA2_S3CR   |= 0
              | S3CR_TEIE
              | S3CR_TCIE
              ;
  _StatusDMA  = 0;
#endif
#if ALIGNED_DMA_BURSTS
  //
  // The memory address must be aligned to burst size.
  // If this is not the case use single transfers.
  //
  DMA2_S3CR   &= ~S3CR_MBURST_MASK;
  if (((U32)pMemory & 0xFuL)  == 0 &&   // Can DMA perform bursts of 16 bytes?
      ((NumBytes    & 0xFFuL) == 0)) {
    DMA2_S3CR |= S3CR_MBURST_INCR4;
  } else {
    DMA2_S3CR |= S3CR_MBURST_NONE;
  }
#endif // ALIGNED_DMA_BURSTS
#if (FS_VERSION > 40405)
  if (_RepeatSame) {
    DMA2_S3CR &= ~S3CR_MINC;      // Do not increment memory pointer when filling with the same 32-bit value.
  } else {
    DMA2_S3CR |=  S3CR_MINC;      // Increment the memory pointer when writing entire blocks.
  }
#endif // FS_VERSION > 40405
  DMA2_S3CR   |= S3CR_EN;               // Start the data transfer
}

/*********************************************************************
*
*       _CopyDataWithDMA
*/
static int _CopyDataWithDMA(U32 * pDest, U32 * pSrc, U32 NumBytes) {
  int r;
  U32 Status;

  r = 0;                              // Set to indicate success.
  DMA2_S3CR &= ~S3CR_EN;              // Stop the data transfer
  while (DMA2_S3CR & S3CR_EN) {       // Wait for the stream to switch off
    ;
  }
  DMA2_S3PAR  = (U32)pSrc;            // Periphery data register address
  DMA2_S3M0AR = (U32)pDest;           // Memory buffer address
  DMA2_S3NDTR = NumBytes >> 2;        // 4 bytes at a time are transferred.
  DMA2_LIFCR  = 0                     // Clear any pending interrupts.
              | LIFCR_CDMEIF3
              | LIFCR_CTEIF3
              | LIFCR_CHTIF3
              | LIFCR_CTCIF3
              | LIFCR_CFEIF3
              ;
  DMA2_S3CR   = 0
              | S3CR_PSIZE_32BIT      // Peripheral bus width
              | S3CR_MSIZE_32BIT      // Memory bus width
              | S3CR_MINC             // Memory increment enable
              | S3CR_PINC             // Memory increment enable
              | S3CR_PBURST_INCR4     // Burst transfer on peripheral side
              | S3CR_MBURST_INCR4     // Burst transfer on memory side
              | S3CR_DIR_M2M          // Perform a memory to memory transfer
              ;
  DMA2_S3FCR  = 0
              | S3FCR_FTH_FULL      // Full FIFO
              | S3FCR_DMDIS         // Disable direct mode
              ;
  DMA2_S3CR   |= S3CR_EN;             // Start the data transfer
  while (1) {                         // Wait for the end of data transfer
    Status = DMA2_LISR;
    if (Status & LISR_TEIF3) {
      r = 1;
      break;                          // Error, could not copy data.
    }
    if (Status & LISR_FEIF3) {
      r = 1;
      break;                          // Error, could not copy data.
    }
    if (Status & LISR_TCIF3) {
      break;                          // OK, transfer completed successfully.
    }
  }
  if (r) {
    DMA2_S3CR &= ~S3CR_EN;            // Stop the data transfer
    while (DMA2_S3CR & S3CR_EN) {     // Wait for the stream to switch off
      ;
    }
  }
  return r;
}

/*********************************************************************
*
*       _IsDCacheEnabled
*
*  Function description
*    Returns if the data cache is enabled.
*/
static int _IsDCacheEnabled(void) {
  int r;

  r = 0;
  if (SCB_CCR & (1uL << CCR_DC_BIT)) {      // Is data cache enabled?
    r = 1;
  }
  return r;
}

/*********************************************************************
*
*       _InvalidateDCache
*
*  Function description
*    Invalidates the lines of the data cache
*    which store a specified memory range.
*/
static void _InvalidateDCache(U32 * p, U32 NumBytes) {
  U32 AddrBegin;
  U32 AddrEnd;

