ukhan717/VncWsFtp/FS/Setup/STM32F746_ST_STM32F746G_Discovery/FS_MMC_CM_HW_STM32F746_ST_STM32F746G-DISCO.c
  if (NumBytes) {
    //
    // Align the address and the number of bytes to a cache line.
    //
    AddrBegin = (U32)p;
    AddrEnd   = AddrBegin + NumBytes;
    AddrBegin = _RoundDownToCacheLine(AddrBegin);
    AddrEnd   = _RoundUpToCacheLine(AddrEnd);
    NumBytes  = AddrEnd - AddrBegin;
    SCB_InvalidateDCache_by_Addr((unsigned int *)AddrBegin, (int)NumBytes);
  }
}

/*********************************************************************
*
*       _CleanDCache
*
*  Function description
*    Cleans the lines of the data cache
*    which store a specified memory range.
*/
static void _CleanDCache(U32 * p, U32 NumBytes) {
  U32 AddrBegin;
  U32 AddrEnd;

  if (NumBytes) {
    //
    // Align the address and the number of bytes to a cache line.
    //
    AddrBegin = (U32)p;
    AddrEnd   = AddrBegin + NumBytes;
    AddrBegin = _RoundDownToCacheLine(AddrBegin);
    AddrEnd   = _RoundUpToCacheLine(AddrEnd);
    NumBytes  = AddrEnd - AddrBegin;
    SCB_CleanDCache_by_Addr((unsigned int *)AddrBegin, (int)NumBytes);
  }
}

/*********************************************************************
*
*       _IsDataCached
*/
static int _IsDataCached(U32 * pData) {
  int r;

  //
  // Add addresses above 0x20010000 are accessed via L1 cache of the CPU.
  //
  r = 0;
  if (_IsDCacheEnabled() && ((U32)pData >= 0x20010000)) {
    r = 1;
  }
  return r;
}

/*********************************************************************
*
*       _StartDMARead
*/
static void _StartDMARead(U32 * pData, U32 NumBytes) {
  if (_IsDataCached(pData)) {
    //
    // Make sure that the data is consistent by cleaning the caches.
    //
    _CleanDCache(pData, NumBytes);
  }
  _StartDMATransfer(pData, (U32 *)&SDMMC_FIFO, PERIPHERAL_TO_MEMORY);
}

/*********************************************************************
*
*       _StartDMAWrite
*/
static void _StartDMAWrite(U32 * pData, U32 NumBytes) {
  if (_IsDataCached(pData)) {
    //
    // Make sure that the data is consistent by cleaning the caches.
    //
    _CleanDCache(pData, NumBytes);
  }
  _StartDMATransfer(pData, (U32 *)&SDMMC_FIFO, MEMORY_TO_PERIPHERAL);
}

/*********************************************************************
*
*       _WaitForEndOfDMARead
*
*  Function description
*    Waits until the current DMA read operation finishes.
*/
static int _WaitForEndOfDMARead(void) {
  U32 StatusSDIO;
  U32 StatusDMA;
  int r;

  r = FS_MMC_CARD_READ_TIMEOUT;
  while (1) {
#if USE_OS
    StatusSDIO = _StatusSDIO;
    StatusDMA  = _StatusDMA;
#else
    StatusSDIO = SDMMC_STA;
    StatusDMA  = DMA2_LISR;
#endif
    if (StatusDMA & LISR_TEIF3) {
      r = FS_MMC_CARD_READ_GENERIC_ERROR;
      break;
    }
    if (StatusSDIO & STA_DCRCFAIL) {
      r = FS_MMC_CARD_READ_CRC_ERROR;
      break;
    }
    if (StatusSDIO & STA_DTIMEOUT) {
      r = FS_MMC_CARD_READ_TIMEOUT;
      break;
    }
    if (StatusSDIO & STA_RXOVERR) {
      r = FS_MMC_CARD_READ_GENERIC_ERROR;
      break;
    }
    if (StatusSDIO & STA_STBITERR) {
      r = FS_MMC_CARD_READ_GENERIC_ERROR;
      break;
    }
    if (StatusDMA & LISR_TCIF3) {
      r = FS_MMC_CARD_NO_ERROR;
      break;
    }
#if USE_OS
    FS_X_OS_Wait(WAIT_TIMEOUT_MAX);
#endif
  }
  //
  // In case of an error, disable DMA and the data state machine in SDMMC.
  //
  if (r) {
    DMA2_S3CR &= ~S3CR_EN;            // Stop the data transfer
    while (DMA2_S3CR & S3CR_EN) {     // Wait for the stream to switch off
      ;
    }
    SDMMC_DCTRL &= ~DCTRL_DTEN;        // Cancel SDMMC data transfer.
  }
  return r;
}

/*********************************************************************
*
*       _WaitForEndOfDMARead
*
*  Function description
*    Waits until the current DMA write operation finishes.
*/
static int _WaitForEndOfDMAWrite(void) {
  U32 StatusSDIO;
  U32 StatusDMA;
  int r;

  r = FS_MMC_CARD_WRITE_GENERIC_ERROR;
  //
  // Data transfer starts as soon as the Data Control Register of SDIO is updated.
  //
  SDMMC_DCTRL = 0
             | _DataBlockSize
             | DCTRL_DTEN
             | DCTRL_DMAEN
             ;
  while (1) {
#if USE_OS
    StatusSDIO = _StatusSDIO;
    StatusDMA  = _StatusDMA;
#else
    StatusSDIO = SDMMC_STA;
    StatusDMA  = DMA2_LISR;
#endif
    if (StatusDMA & LISR_TEIF3) {
      r = FS_MMC_CARD_WRITE_GENERIC_ERROR;
      break;
    }
    if (StatusSDIO & STA_DCRCFAIL) {
      r = FS_MMC_CARD_WRITE_CRC_ERROR;
      break;
    }
    if (StatusSDIO & STA_DTIMEOUT) {
      r = FS_MMC_CARD_WRITE_GENERIC_ERROR;
      break;
    }
    if (StatusSDIO & STA_TXUNDERR) {
      r = FS_MMC_CARD_WRITE_GENERIC_ERROR;
      break;
    }
    if (StatusSDIO & STA_STBITERR) {
      r = FS_MMC_CARD_WRITE_GENERIC_ERROR;
      break;
    }
    if (StatusSDIO & STA_DATAEND) {
      r = FS_MMC_CARD_NO_ERROR;
      break;
    }
#if USE_OS
    FS_X_OS_Wait(WAIT_TIMEOUT_MAX);
#endif
  }
  //
  // In case of an error, disable DMA and the data state machine in SDMMC.
  //
  if (r) {
    DMA2_S3CR &= ~S3CR_EN;            // Stop the data transfer
    while (DMA2_S3CR & S3CR_EN) {     // Wait for the stream to switch off
      ;
    }
    SDMMC_DCTRL &= ~DCTRL_DTEN;        // Cancel SDMMC data transfer.
  }
  return r;
}

/*********************************************************************
*
*       _ProcessDMARead
*
*  Function description
*    Invalidates the data cache of the specified buffer by preserving
*    of the bytes located before and after the buffer when the buffer
*    is not cache aligned. The unaligned bytes are copied via DMA
*    to an internal cache-aligned buffer which is then invalidated.
*    At the end the data is copied via CPU from the internal cache-aligned
*    buffer to the original location in the specified buffer.
*/
static void _ProcessDMARead(U32 * pData, U32 NumBytes) {
  U8  * pData8;
  U32   NumBytesAtOnce;

  if (_IsDataCached(pData)) {
    //
    // Invalidate unaligned leading bytes.
    //
    pData8 = (U8 *)pData;
    NumBytesAtOnce = (U32)pData8 & (CACHE_LINE_SIZE - 1);
    if (NumBytesAtOnce) {
      NumBytesAtOnce = CACHE_LINE_SIZE - NumBytesAtOnce;
      NumBytesAtOnce = SEGGER_MIN(NumBytesAtOnce, NumBytes);
      _CopyDataWithDMA(_pCacheBuffer, (U32 *)(void *)pData8, NumBytesAtOnce);
      _InvalidateDCache(_pCacheBuffer, NumBytesAtOnce);
      FS_MEMCPY(pData8, _pCacheBuffer, NumBytesAtOnce);
      NumBytes -= NumBytesAtOnce;
      pData8   += NumBytesAtOnce;
    }
    //
    // Invalidate aligned bytes.
    //
    if (NumBytes) {
      NumBytesAtOnce = NumBytes & ~(CACHE_LINE_SIZE - 1);
      if (NumBytesAtOnce) {
        _InvalidateDCache((U32 *)(void *)pData8, NumBytesAtOnce);
        NumBytes -= NumBytesAtOnce;
        pData8   += NumBytesAtOnce;
      }
    }
    //
    // Invalidate unaligned trailing bytes.
    //
    if (NumBytes) {
      _CopyDataWithDMA(_pCacheBuffer, (U32 *)(void *)pData8, NumBytes);
      _InvalidateDCache(_pCacheBuffer, NumBytes);
      FS_MEMCPY(pData8, _pCacheBuffer, NumBytes);
    }
  }
}

#if USE_OS

/**********************************************************
*
*       SDMMC1_IRQHandler
*
*  Function description
*    Handles the SDMMC interrupt.
*/
#ifdef __cplusplus
extern "C" {                                  // Prevent function name mangling with C++ compilers.
#endif
void SDMMC1_IRQHandler(void);
#ifdef __cplusplus
}
#endif
void SDMMC1_IRQHandler(void) {
  U32 Status;

  OS_EnterInterrupt();                        // Inform embOS that interrupt code is running.
  Status       = SDMMC_STA;
  //
  // Save the status to a static variable and check it in the task.
  //
  SDMMC_ICR    = Status & ICR_MASK_STATIC;    // Clear the static flags to prevent further interrupts.
  _StatusSDIO &= ICR_MASK_STATIC;             // Clear the dynamic flags
  _StatusSDIO |= Status;
  FS_X_OS_Signal();                           // Wake up the task.
  OS_LeaveInterrupt();                        // Inform embOS that interrupt code is left.
}

/**********************************************************
*
*       DMA2_Channel4_IRQHandler
*
*   Function description
*     Handles the DMA interrupt.
*/
#ifdef __cplusplus
extern "C" {                                  // Prevent function name mangling with C++ compilers.
#endif
void DMA2_Stream3_IRQHandler(void);
#ifdef __cplusplus
}
#endif
void DMA2_Stream3_IRQHandler(void) {
  U32 Status;

  OS_EnterInterrupt();          // Inform embOS that interrupt code is running.
  Status      = DMA2_LISR;
  DMA2_LIFCR  = Status;         // Clear pending interrupt flags.
  Status     &= 0               // Make sure that we clear only the flags assigned to the DMA stream we use.
             | LIFCR_CFEIF3
             | LIFCR_CDMEIF3
             | LIFCR_CTCIF3
             | LIFCR_CHTIF3
             | LIFCR_CTEIF3
             ;
  _StatusDMA |= Status;         // Save the status to a static variable and check it in the task.
  FS_X_OS_Signal();             // Wake up the task.
  OS_LeaveInterrupt();          // Inform embOS that interrupt code is left.
}

#endif

/*********************************************************************
*
*       _WriteRegDelayed
*
*  Function description
*    Waits before writing to a register as specified in the datasheet:
*      "After a data write, data cannot be written to this register for three SDIOCLK
*      (48 MHz) clock periods plus two PCLK2 clock periods."
*/
static void _WriteRegDelayed(volatile U32 * pAddr, U32 Value) {
  volatile U32 NumLoops;

  NumLoops  = _NumLoopsWriteRegDelay;
  do {
    ;
  } while (--NumLoops);
  *pAddr = Value;
}

/*********************************************************************
*
*       _WaitForInactive
*/
static void _WaitForInactive(void) {
  U32 v;
  U32 Status;

  while (1) {
    Status = SDMMC_STA;
    if (((Status & STA_CMDACT) == 0) &&
        ((Status & STA_TXACT)  == 0) &&
        ((Status & STA_RXACT)  == 0)) {
      if (_IsR1Busy == 0) {
        break;
      }
      //
      // The SDIO host controller is not able to handle R1 responses
      // with busy signaling therefore we have to check here the
      // level of the DAT0 line. The SD / MMC device drives the DAT0
      // line to LOW if busy.
      // The SD / MMC devices require to be clocked in order to release
      // the DAT0 line but the SDIO host controller is configured clock
      // the SD/ MMC device only when a command or data is transferred
      // (to prevent DMA issues). For this reason we have to temporarily
      // disable this mode so that the SDIO host controller
      // clocks the SD / MMC device while we are checking the status
      // of the DAT0 line.
      //
      v = SDMMC_CLKCR & ~CLKCR_CLK_PWRSAV;
      _WriteRegDelayed(&SDMMC_CLKCR, v);
      if (GPIOC_IDR & (1uL << SD_D0_BIT)) {
        _IsR1Busy = 0;
        v = SDMMC_CLKCR | CLKCR_CLK_PWRSAV;
        _WriteRegDelayed(&SDMMC_CLKCR, v);
        break;
      }
    }
  }
}

/*********************************************************************
*
*       _Reset
*/
static void _Reset(void) {
  U32 RegValueCLKCR;
  U32 RegValueDTIMER;

  //
  // Save register values that have to be restored later.
  //
  RegValueCLKCR  = SDMMC_CLKCR;
  RegValueDTIMER = SDMMC_DTIMER;
  //
  // Reset the SDMMC unit.
  //
  RCC_APB2RSTR |= APB2RSTR_SDMMCRST;
  RCC_APB2RSTR &= ~APB2RSTR_SDMMCRST;
  //
  // SDMMC uses the stream 3, channel 4 of DMA2
  //
  DMA2_S3CR &= ~S3CR_EN;            // Stop the data transfer
  while (DMA2_S3CR & S3CR_EN) {     // Wait for the stream to switch off
    ;
  }
  DMA2_LIFCR |= 0                   // Clear any pending interrupts.
             |  LIFCR_CDMEIF3
             |  LIFCR_CTEIF3
             |  LIFCR_CHTIF3
             |  LIFCR_CTCIF3
             |  LIFCR_CFEIF3
             ;
#if USE_OS
  _StatusSDIO = 0;
  _StatusDMA  = 0;
#endif
  //
  // Initialize the SDMMC unit.
  //
  SDMMC_POWER  = 0;    // Power off
  SDMMC_CLKCR  = 0;    // Disable the clock.
  SDMMC_ARG    = 0;
  SDMMC_CMD    = 0;
  SDMMC_DTIMER = 0;
  SDMMC_DLEN   = 0;
  SDMMC_DCTRL  = 0;
  SDMMC_ICR    = 0x00C007FF;       // Clear interrupts
  SDMMC_MASK   = MASK_ALL;
  _WriteRegDelayed(&SDMMC_POWER, 3);     // Make sure that SDMMC_POWER is written after the specified delay.
  _WriteRegDelayed(&SDMMC_CLKCR, RegValueCLKCR);
  SDMMC_DTIMER = RegValueDTIMER;
}

/*********************************************************************
*
*       Public code (via callback)
*
**********************************************************************
*/

/*********************************************************************
*
*       _HW_Init
*
*  Function description
*    Initialize the SD / MMC host controller.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*/
static void _HW_Init(U8 Unit) {
  unsigned ms;
  U32      Delay_ns;
  U32      Inst_ns;
  U32      Addr;

  FS_USE_PARA(Unit);
  //
  // Prepare the cache buffer.
  //
  Addr = (U32)_aCacheBuffer;
  Addr = _RoundUpToCacheLine(Addr);
  _pCacheBuffer = (U32 *)Addr;
  //
  // Reset the SDMMC unit.
  //
  RCC_APB2RSTR |= APB2RSTR_SDMMCRST;
  RCC_APB2RSTR &= ~APB2RSTR_SDMMCRST;

  //
  // Enable GPIOs, DMA and SDMMC units.
  //
  RCC_AHB1ENR |= 0
              |  AHB1ENR_DMA2EN
              |  AHB1ENR_PORTCEN
              |  AHB1ENR_PORTDEN
              ;
  RCC_APB2ENR |= 0
              |  APB2ENR_SDMMCEN
              ;
  //
  // D0, D1, D2, D3, CLK signals are controlled by SDMMC
  //
  GPIOC_MODER &= ~((3uL << (SD_D0_BIT  << 1)) |
                   (3uL << (SD_D1_BIT  << 1)) |
                   (3uL << (SD_D2_BIT  << 1)) |
                   (3uL << (SD_D3_BIT  << 1)) |
                   (3uL << (SD_CLK_BIT << 1)));
  GPIOC_MODER |= (2uL << (SD_D0_BIT  << 1))
              |  (2uL << (SD_D1_BIT  << 1))
              |  (2uL << (SD_D2_BIT  << 1))
              |  (2uL << (SD_D3_BIT  << 1))
              |  (2uL << (SD_CLK_BIT << 1))
              ;
  GPIOC_PUPDR &= ~((3uL << (SD_D0_BIT  << 1)) |
                   (3uL << (SD_D1_BIT  << 1)) |
                   (3uL << (SD_D2_BIT  << 1)) |
                   (3uL << (SD_D3_BIT  << 1)) |
                   (3uL << (SD_CLK_BIT << 1)));
  GPIOC_AFRH  &= ~((0xFuL << ((SD_D0_BIT - 8)  << 2)) |
                   (0xFuL << ((SD_D1_BIT - 8) << 2))  |
                   (0xFuL << ((SD_D2_BIT - 8)  << 2)) |
                   (0xFuL << ((SD_D3_BIT - 8)  << 2)) |
                   (0xFuL << ((SD_CLK_BIT - 8) << 2)));
  GPIOC_AFRH  |= (12uL << ((SD_D0_BIT - 8)  << 2))
              |  (12uL << ((SD_D1_BIT - 8)  << 2))
              |  (12uL << ((SD_D2_BIT - 8)  << 2))
              |  (12uL << ((SD_D3_BIT - 8)  << 2))
              |  (12uL << ((SD_CLK_BIT - 8) << 2));
  GPIOC_OSPEEDR &= ~((3uL << (SD_D0_BIT  << 1)) |
                    (3uL << (SD_D1_BIT  << 1))  |
                    (3uL << (SD_D2_BIT  << 1))  |
                    (3uL << (SD_D3_BIT  << 1))  |
                    (3uL << (SD_CLK_BIT << 1)));
  GPIOC_OSPEEDR |= (3uL << (SD_D0_BIT  << 1)) |
                   (3uL << (SD_D1_BIT  << 1)) |
                   (3uL << (SD_D2_BIT  << 1)) |
                   (3uL << (SD_D3_BIT  << 1)) |
                   (3uL << (SD_CLK_BIT << 1));    // High speed ports
  //
  // The CMD signal is also controlled by SDMMC
  //
  GPIOD_MODER   &= ~(3uL   << (SD_CMD_BIT << 1));
  GPIOD_MODER   |=  (2uL   << (SD_CMD_BIT << 1));
  GPIOD_PUPDR   &= ~(3uL   << (SD_CMD_BIT << 1));
  GPIOD_AFRL    &= ~(0xFuL << (SD_CMD_BIT << 2));
  GPIOD_AFRL    |=  (12uL  << (SD_CMD_BIT << 2));
  GPIOD_OSPEEDR &= ~(3uL   << (SD_CMD_BIT << 1));
  GPIOD_OSPEEDR |=  (2uL   << (SD_CMD_BIT << 1));
  //
  // The CD signal is controlled by this HW layer.
  //
  GPIOC_MODER   &= ~(3uL   << (SD_CD_BIT << 1));
  GPIOC_PUPDR   &= ~(3uL   << (SD_CD_BIT << 1));
  GPIOC_AFRH    &= ~(0xFuL << ((SD_CD_BIT - 8) << 2));
  GPIOC_OSPEEDR &= ~(3uL   << (SD_CD_BIT << 1));
  //
  // SDMMC uses the stream 3, channel 4 of DMA2
  //
  DMA2_S3CR   &= ~S3CR_EN;          // Stop the data transfer
  while (DMA2_S3CR & S3CR_EN) {     // Wait for the stream to switch off
    ;
  }
  DMA2_LIFCR  |= LIFCR_CDMEIF3      // Clear any pending interrupts.
              |  LIFCR_CTEIF3
              |  LIFCR_CHTIF3
              |  LIFCR_CTCIF3
              |  LIFCR_CFEIF3
              ;
  //
  // Compute the number of software loops to delay before writing to some SDMMC registers.
  //
  Delay_ns  = (1000000000uL + ((SDMMC_CLK_KHZ * 3) - 1)) / (SDMMC_CLK_KHZ * 3);
  Delay_ns += (1000000000uL + ((PCLK2 * 2) - 1)) / (PCLK2 * 2);
  Inst_ns   = (1000000000uL + (HCLK - 1)) / HCLK;
  _NumLoopsWriteRegDelay = Delay_ns / Inst_ns;
  //
  // Initialize SDMMC
  //
  SDMMC_POWER  = 0;    // Power off
  SDMMC_CLKCR  = 0;    // Disable the clock.
  SDMMC_ARG    = 0;
  SDMMC_CMD    = 0;
  SDMMC_DTIMER = 0;
  SDMMC_DLEN   = 0;
  SDMMC_DCTRL  = 0;
  SDMMC_ICR    = 0x00C007FF;       // Clear interrupts
  SDMMC_MASK   = 0;
  _WriteRegDelayed(&SDMMC_POWER, 3);     // Make sure that SDMMC_POWER is written after the specified delay.
#if USE_OS
  //
  // Unmask the interrupt sources.
  //
  SDMMC_MASK   = MASK_ALL;
  //
  // Set the priority and enable the interrupts.
  //
  NVIC_SetPriority(DMA2_Stream3_IRQn, DMA_PRIO);
  NVIC_SetPriority(SDMMC1_IRQn, SDMMC_PRIO);
  NVIC_EnableIRQ(DMA2_Stream3_IRQn);
  NVIC_EnableIRQ(SDMMC1_IRQn);
#endif
  //
  // Wait for the power supply of the SD card to become ready.
  //
  ms = POWER_GOOD_DELAY;
  while (ms--) {
    _Delay1ms();
  }
}

/*********************************************************************
*
*       _HW_Delay
*
*  Function description
*    Blocks the execution for the specified time.
*
*  Parameters
*    ms   Number of milliseconds to delay.
*/
static void _HW_Delay(int ms) {
  while (ms--) {
    _Delay1ms();
  }
}

/*********************************************************************
*
*       _HW_IsPresent
*
*  Function description
*    Returns the state of the media. If you do not know the state,
*    return FS_MEDIA_STATE_UNKNOWN and the higher layer will try to
*    figure out if a storage device is present.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*
*  Return value
*    FS_MEDIA_STATE_UNKNOWN     The state of the media is unknown
*    FS_MEDIA_NOT_PRESENT       No card is present
*    FS_MEDIA_IS_PRESENT        A card is present
*/
static int _HW_IsPresent(U8 Unit) {
  int Status;

  FS_USE_PARA(Unit);
  Status = FS_MEDIA_IS_PRESENT;
  if (GPIOC_IDR & (1uL << SD_CD_BIT)) {
    Status = FS_MEDIA_NOT_PRESENT;
  }
  return Status;
}

/*********************************************************************
*
*       _HW_IsWriteProtected
*
*  Function description
*    Returns whether card is write protected or not.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*/
static int _HW_IsWriteProtected(U8 Unit) {
  FS_USE_PARA(Unit);
  return 0;
}

/*********************************************************************
*
*       _HW_SetMaxSpeed
*
*  Function description
*    Sets the frequency of the MMC/SD card controller.
*    The frequency is given in kHz.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*
*  Additional information
*    This function is called two times:
*    1. During card initialization
*       Initialize the frequency to not more than 400kHz.
*
*    2. After card initialization
*       The CSD register of card is read and the max frequency
*       the card can operate is determined.
*       [In most cases: MMC cards 20MHz, SD cards 25MHz]
*/
static U16 _HW_SetMaxSpeed(U8 Unit, U16 Freq) {
  U32      Fact;
  unsigned Div;
  U32      ClkBypass;
  U32      v;

  FS_USE_PARA(Unit);
  if (Freq > MAX_SD_CLK_KHZ) {
    Freq = MAX_SD_CLK_KHZ;
  }
  _WaitForInactive();
  SDMMC_CLKCR &= ~(CLKCR_CLKEN | 0xFFuL | CLKCR_CLK_BYPASS);
  Fact        = 2;
  Div         = 0;
  ClkBypass   = CLKCR_CLK_BYPASS;
  if (Freq < SDMMC_CLK_KHZ) {
    ClkBypass = 0;
    while ((Freq * Fact) < SDMMC_CLK_KHZ) {
      ++Fact;
      if (0xFF == ++Div) {
        break;
      }
    }
  }
  v = 0
    | SDMMC_CLKCR
    | Div
    | CLKCR_CLKEN
    | CLKCR_CLK_PWRSAV
    | CLKCR_HWFC_EN         // Enable flow control to prevent over-/underflow errors in the data transfer.
    | ClkBypass
    ;
  _WriteRegDelayed(&SDMMC_CLKCR, v);
  return SDMMC_CLK_KHZ / (Div + 2);
}

/*********************************************************************
*
*       _HW_SetResponseTimeOut
*
*  Function description
*    Sets the maximum time the SD / MMC host controller
*    has to wait for a response.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*    Value    Number of SD / MMC clock cycles.
*/
static void _HW_SetResponseTimeOut(U8 Unit, U32 Value) {
  FS_USE_PARA(Unit);
  FS_USE_PARA(Value);
  //
  // The response timeout is fixed in hardware
  //
}

/*********************************************************************
*
*       _HW_SetReadDataTimeOut
*
*  Function description
*    Sets the maximum time the SD / MMC host controller has to wait
*    for the arrival of data.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*    Value    Number of SD / MMC clock cycles.
*/
static void _HW_SetReadDataTimeOut(U8 Unit, U32 Value) {
  FS_USE_PARA(Unit);
  SDMMC_DTIMER = Value;
}

/*********************************************************************
*
*       _HW_SendCmd
*
*  Function description
*    Sends a command to the card.
*
*  Parameters
*    Unit           Index of the SD / MMC host controller (0-based).
*    Cmd            Command number according to [1]
*    CmdFlags       Additional information about the command to execute
*    ResponseType   Type of response as defined in [1]
*    Arg            Command parameter
*/
static void _HW_SendCmd(U8 Unit, unsigned Cmd, unsigned CmdFlags, unsigned ResponseType, U32 Arg) {
  U32 CmdCfg;
  U32 NumBytes;
  U32 Status;
  U32 v;

